export const NOTIFY_TEXT = {
  default: "Возникла непредвиденная ошибка :(",
  createSuccess: "Пользователь успешно создан!",
  createFailure: "Не удалось создать нового пользователя :(",
  editSuccess: "Данные пользователя успешно сохранены!",
  editFailure:
    "Невозможно изменить роль пользователя, поскольку не удалось найти нового начальника его подчиненным. Назначьте одному из гипотетических руководителей более высокую роль и повторите попытку.",
  deleteSuccess: "Пользователь успешно удален!",
  deleteFailure:
    "Невозможно удалить пользователя, поскольку не удалось найти нового начальника его подчиненным. Назначьте одному из гипотетических руководителей более высокую роль и повторите попытку.",
};
